<html w="urn:schemas-microsoft-com:office:word" v="urn:schemas-microsoft-com:vml" xmlns="http://www.w3.org/TR/REC-html40" o="urn:schemas-microsoft-com:office:office" m="http://schemas.microsoft.com/office/2004/12/omml">
  <head>
    <style type="text/css">
      <!--
        li.msonormal { margin-bottom: 10.0pt; margin-right: 0cm; margin-top: 0cm; font-size: 11.0pt; margin-left: 0cm; text-align: right; font-family: Calibri,sans-serif; line-height: 115% }
        a:visited { text-decoration: underline; color: purple }
        p { margin-right: 0cm; font-size: 12.0pt; margin-left: 0cm; font-family: Times New Roman,serif }
        .MsoPapDefault { margin-bottom: 10.0pt; line-height: 115% }
        h1 { margin-right: 0cm; font-size: 24.0pt; font-weight: bold; margin-left: 0cm; font-family: Times New Roman,serif }
        span.msohyperlink { text-decoration: underline; color: blue }
        span.msohyperlinkfollowed { text-decoration: underline; color: purple }
        p.msonormal { margin-bottom: 10.0pt; margin-right: 0cm; margin-top: 0cm; font-size: 11.0pt; margin-left: 0cm; text-align: right; font-family: Calibri,sans-serif; line-height: 115% }
        a:link { text-decoration: underline; color: blue }
        div.msonormal { margin-bottom: 10.0pt; margin-right: 0cm; margin-top: 0cm; font-size: 11.0pt; margin-left: 0cm; text-align: right; font-family: Calibri,sans-serif; line-height: 115% }
        span.heading1char { font-weight: bold; font-family: Times New Roman,serif }
      -->
    </style>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <meta content="Word.Document" name="ProgId">
    <meta content="Microsoft Word 12" name="Generator">
    <meta content="Microsoft Word 12" name="Originator">
    <link rel="File-List" href="file:///C:\DOCUME~1\afzalan\LOCALS~1\Temp\13\msohtmlclip1\01\clip_filelist.xml">
    <link rel="themeData" href="file:///C:\DOCUME~1\afzalan\LOCALS~1\Temp\13\msohtmlclip1\01\clip_themedata.thmx">
    <link rel="colorSchemeMapping" href="file:///C:\DOCUME~1\afzalan\LOCALS~1\Temp\13\msohtmlclip1\01\clip_colorschememapping.xml">
    
  </head>
  <body lang="EN-US" link="blue" vlink="purple">
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1593;&#1606;&#1608;&#1575;&#1606; 
      &#1705;&#1575;&#1585;&#1711;&#1575;&#1607; &#1570;&#1605;&#1608;&#1586;&#1588;&#1610;:</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="text-indent: 36.0pt" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; 
      &#1578;&#1580;&#1607;&#1610;&#1586;&#1575;&#1578; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1610; &#1583;&#1585; &#1589;&#1606;&#1593;&#1578; &#1606;&#1601;&#1578;&#1548; &#1711;&#1575;&#1586; &#1608; &#1662;&#1578;&#1585;&#1608;&#1588;&#1610;&#1605;&#1610; &#1578;&#1608;&#1587;&#1591; &#1705;&#1583;&#1607;&#1575;&#1610; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586;</font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1605;&#1608;&#1590;&#1608;&#1593;:</font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span><font size="14.0pt" face="Traffic">&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; </font></span><font size="14.0pt" face="Traffic"><span lang="FA" style="line-height: 115%">&#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; 
      &#1578;&#1580;&#1607;&#1610;&#1586;&#1575;&#1578; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1610; &#1583;&#1585; &#1589;&#1606;&#1593;&#1578; &#1605;&#1607;&#1605; &#1606;&#1601;&#1578; &#1610;&#1705;&#1610; &#1575;&#1586; &#1585;&#1607;&#1610;&#1575;&#1601;&#1578; &#1607;&#1575;&#1610; &#1576;&#1606;&#1610;&#1575;&#1583;&#1610; &#1580;&#1607;&#1578; &#1705;&#1587;&#1576; &#1583;&#1575;&#1606;&#1588; 
      &#1601;&#1606;&#1610; &#1608; &#1578;&#1608;&#1587;&#1593;&#1607; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1610; &#1575;&#1610;&#1606; &#1589;&#1606;&#1593;&#1578; &#1576;&#1607; &#1588;&#1605;&#1575;&#1585; &#1605;&#1610;&#1570;&#1610;&#1583;. &#1576;&#1582;&#1588; &#1607;&#1575;&#1610; &#1605;&#1582;&#1578;&#1604;&#1601; &#1575;&#1610;&#1606; &#1589;&#1606;&#1593;&#1578; 
      &#1606;&#1592;&#1610;&#1585; &#1591;&#1585;&#1575;&#1581;&#1610;&#1548; &#1576;&#1607;&#1610;&#1606;&#1607; &#1587;&#1575;&#1586;&#1610;&#1548; &#1605;&#1583;&#1610;&#1585;&#1578; &#1662;&#1585;&#1608;&#1688;&#1607; &#1607;&#1575; &#1608; &#1705;&#1606;&#1578;&#1585;&#1604; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583; &#1576;&#1583;&#1608;&#1606; &#1583;&#1585; &#1575;&#1582;&#1578;&#1610;&#1575;&#1585; 
      &#1583;&#1575;&#1588;&#1578;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610; &#1578;&#1582;&#1589;&#1589;&#1610; &#1604;&#1575;&#1586;&#1605; &#1575;&#1605;&#1705;&#1575;&#1606; &#1662;&#1584;&#1610;&#1585; &#1606;&#1605;&#1610;&#1576;&#1575;&#1588;&#1606;&#1583;. &#1575;&#1605;&#1575; &#1578;&#1608;&#1587;&#1593;&#1607; &#1606;&#1585;&#1605; 
      &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610; &#1705;&#1575;&#1585;&#1576;&#1585;&#1583;&#1610; &#1606;&#1610;&#1575;&#1586; &#1576;&#1607; &#1591;&#1585;&#1575;&#1581;&#1610; &#1605;&#1575;&#1688;&#1608;&#1604;&#1607;&#1575;&#1610; &#1586;&#1610;&#1585;&#1576;&#1606;&#1575;&#1610;&#1610; &#1605;&#1575;&#1606;&#1606;&#1583; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; &#1578;&#1580;&#1607;&#1610;&#1586;&#1575;&#1578;&#1548; 
      &#1588;&#1576;&#1610;&#1607; &#1587;&#1575;&#1586;&#1610; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1548; &#1605;&#1581;&#1575;&#1587;&#1576;&#1607; &#1582;&#1608;&#1575;&#1589; &#1578;&#1585;&#1605;&#1608;&#1601;&#1610;&#1586;&#1610;&#1705;&#1610; &#1587;&#1610;&#1575;&#1604;&#1575;&#1578; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1610; &#1608; &#1608;&#1575;&#1587;&#1591; &#1607;&#1575;&#1610; 
      &#1705;&#1575;&#1585;&#1576;&#1585;&#1610; &#1605;&#1585;&#1576;&#1608;&#1591;&#1607; &#1583;&#1575;&#1585;&#1583;. &#1670;&#1606;&#1610;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610;&#1610; &#1581;&#1608;&#1586;&#1607; &#1607;&#1575;&#1610; &#1608;&#1587;&#1610;&#1593;&#1610; &#1575;&#1586; &#1593;&#1604;&#1608;&#1605; &#1605;&#1607;&#1606;&#1583;&#1587;&#1610; &#1585;&#1575; 
      &#1576;&#1607; &#1705;&#1575;&#1585; &#1605;&#1610;&#1591;&#1604;&#1576;&#1583;. &#1605;&#1581;&#1575;&#1587;&#1576;&#1575;&#1578; &#1593;&#1583;&#1583;&#1610;&#1548; &#1578;&#1585;&#1605;&#1608;&#1583;&#1610;&#1606;&#1575;&#1605;&#1610;&#1705;&#1548; &#1605;&#1705;&#1575;&#1606;&#1610;&#1705; &#1587;&#1610;&#1575;&#1604;&#1575;&#1578;&#1548; &#1591;&#1585;&#1575;&#1581;&#1610; &#1605;&#1576;&#1583;&#1604;&#1607;&#1575;&#1548; 
      &#1578;&#1608;&#1576;&#1585;&#1576;&#1608;&#1605;&#1575;&#1588;&#1610;&#1606; &#1578;&#1606;&#1607;&#1575; &#1576;&#1582;&#1588;&#1610; &#1575;&#1586; &#1578;&#1582;&#1589;&#1589;&#1607;&#1575;&#1610; &#1604;&#1575;&#1586;&#1605; &#1583;&#1585; &#1605;&#1607;&#1606;&#1583;&#1587;&#1610; &#1605;&#1705;&#1575;&#1606;&#1610;&#1705; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583; &#1705;&#1607; &#1604;&#1575;&#1586;&#1605;&#1607; 
      &#1591;&#1585;&#1575;&#1581;&#1610; &#1605;&#1583;&#1604;&#1607;&#1575;&#1610; &#1605;&#1606;&#1575;&#1587;&#1576; &#1575;&#1586; &#1578;&#1580;&#1607;&#1610;&#1586;&#1575;&#1578; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1610; &#1605;&#1610;&#1576;&#1575;&#1588;&#1606;&#1583;. &#1583;&#1585;&#1608;&#1587; &#1578;&#1582;&#1589;&#1589;&#1610; &#1583;&#1585; &#1605;&#1607;&#1606;&#1583;&#1587;&#1610; 
      &#1588;&#1610;&#1605;&#1610;&#1548; &#1705;&#1575;&#1605;&#1662;&#1610;&#1608;&#1578;&#1585; &#1608; &#1576;&#1585;&#1602; &#1606;&#1610;&#1586; &#1583;&#1585; &#1576;&#1582;&#1588;&#1607;&#1575;&#1610; &#1605;&#1607;&#1605;&#1610; &#1575;&#1586; &#1662;&#1610;&#1575;&#1583;&#1607; &#1587;&#1575;&#1586;&#1610; &#1670;&#1606;&#1610;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610;&#1610; 
      &#1705;&#1575;&#1585;&#1576;&#1585;&#1583; &#1583;&#1575;&#1585;&#1606;&#1583;.</span></font>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1606;&#1711;&#1575;&#1607; 
      &#1605;&#1582;&#1578;&#1589;&#1585;&#1610; &#1576;&#1607; &#1608;&#1590;&#1593;&#1610;&#1578; &#1605;&#1575;&#1604;&#1610; &#1588;&#1585;&#1705;&#1578; </font></span><span style="line-height: 115%" dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Aspen 
      Technology</font></span><span style="line-height: 115%"><font size="14.0pt" face="Traffic"> 
      </font></span><font size="14.0pt" face="Traffic"><span lang="FA">(&#1575;&#1610;&#1606; 
      &#1588;&#1585;&#1705;&#1578; &#1583;&#1585; &#1587;&#1575;&#1604; 1981 &#1578;&#1608;&#1587;&#1591; &#1583;&#1705;&#1578;&#1585; &#1604;&#1585;&#1610; &#1575;&#1610;&#1608;&#1575;&#1606;&#1586; </span></font><span style="line-height: 115%" dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Dr. 
      Larry Evans</font></span><span style="line-height: 115%"><font size="14.0pt" face="Traffic"> 
      </font></span><font size="14.0pt" face="Traffic"><span lang="FA">&#1610;&#1705;&#1610; &#1575;&#1586; 
      &#1575;&#1587;&#1575;&#1578;&#1610;&#1583; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607; </span></font><span style="line-height: 115%" dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">MIT</font></span><span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic"> 
      &#1583;&#1585; &#1585;&#1588;&#1578;&#1607; &#1605;&#1607;&#1606;&#1583;&#1587;&#1610; &#1588;&#1610;&#1605;&#1610; &#1578;&#1575;&#1587;&#1610;&#1587; &#1588;&#1583;&#1607; &#1575;&#1587;&#1578;) &#1705;&#1607; &#1605;&#1607;&#1605;&#1578;&#1585;&#1610;&#1606; &#1605;&#1581;&#1589;&#1608;&#1604; &#1570;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; </font></span><span style="line-height: 115%" dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Aspen</font></span><span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic"> 
      &#1583;&#1585; &#1588;&#1576;&#1610;&#1607; &#1587;&#1575;&#1586;&#1610; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583;&#1548; &#1606;&#1588;&#1575;&#1606; &#1605;&#1610;&#1583;&#1607;&#1583; &#1583;&#1585;&#1570;&#1605;&#1583; &#1575;&#1610;&#1606; &#1588;&#1585;&#1705;&#1578; &#1583;&#1585; &#1587;&#1575;&#1604; 2011 &#1605;&#1593;&#1575;&#1583;&#1604; 
      166 &#1605;&#1610;&#1604;&#1610;&#1608;&#1606; &#1583;&#1604;&#1575;&#1585; &#1576;&#1608;&#1583;&#1607; &#1575;&#1587;&#1578; &#1705;&#1607; &#1591;&#1610; &#1583;&#1608; &#1587;&#1575;&#1604; &#1583;&#1585; &#1588;&#1585;&#1575;&#1610;&#1591; &#1576;&#1581;&#1585;&#1575;&#1606; &#1575;&#1602;&#1578;&#1589;&#1575;&#1583;&#1610; &#1576;&#1607; &#1576;&#1610;&#1588; &#1575;&#1586; 
      311 &#1605;&#1610;&#1604;&#1610;&#1608;&#1606; &#1583;&#1604;&#1575;&#1585; &#1585;&#1587;&#1610;&#1583;&#1607; &#1575;&#1587;&#1578;. &#1575;&#1610;&#1606; &#1588;&#1585;&#1705;&#1578; &#1591;&#1610; 3 &#1587;&#1575;&#1604; &#1576;&#1610;&#1588; &#1575;&#1586; 200 &#1605;&#1610;&#1604;&#1610;&#1608;&#1606; &#1583;&#1604;&#1575;&#1585; 
      &#1607;&#1586;&#1610;&#1606;&#1607; &#1578;&#1581;&#1602;&#1610;&#1602; &#1608; &#1578;&#1608;&#1587;&#1593;&#1607; &#1606;&#1605;&#1608;&#1583;&#1607; &#1575;&#1587;&#1578; &#1705;&#1607; &#1606;&#1588;&#1575;&#1606; &#1605;&#1610;&#1583;&#1607;&#1583; &#1578;&#1608;&#1587;&#1593;&#1607; &#1575;&#1610;&#1606; &#1589;&#1606;&#1593;&#1578; &#1578;&#1575; &#1670;&#1607; &#1581;&#1583;&#1610; 
      &#1608;&#1575;&#1576;&#1587;&#1578;&#1607; &#1576;&#1607; &#1662;&#1688;&#1608;&#1607;&#1588; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583;. &#1587;&#1608;&#1583; &#1582;&#1575;&#1604;&#1589; &#1570;&#1606; &#1583;&#1585; &#1587;&#1575;&#1604; &#1605;&#1575;&#1604;&#1610; 2013 &#1548; &#1662;&#1587; &#1575;&#1586; &#1705;&#1587;&#1585; &#1605;&#1575;&#1604;&#1610;&#1575;&#1578; 
      &#1576;&#1610;&#1588; &#1575;&#1586; 45 &#1605;&#1610;&#1604;&#1610;&#1608;&#1606; &#1583;&#1604;&#1575;&#1585; &#1576;&#1608;&#1583;&#1607; &#1575;&#1587;&#1578;. &#1575;&#1610;&#1606; &#1588;&#1585;&#1705;&#1578; &#1578;&#1575; &#1705;&#1606;&#1608;&#1606; &#1575;&#1586; &#1601;&#1585;&#1608;&#1588; &#1604;&#1575;&#1610;&#1587;&#1606;&#1587; 1.67 
      &#1605;&#1610;&#1604;&#1610;&#1575;&#1585;&#1583; &#1583;&#1604;&#1575;&#1585; &#1583;&#1585;&#1570;&#1605;&#1583; &#1583;&#1575;&#1588;&#1578;&#1607; &#1575;&#1587;&#1578; &#1608; &#1583;&#1585;&#1570;&#1605;&#1583; &#1570;&#1606; &#1575;&#1586; &#1605;&#1581;&#1604; &#1601;&#1585;&#1608;&#1588; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1583;&#1585; &#1587;&#1607; &#1605;&#1575;&#1607;&#1607; 
      &#1575;&#1608;&#1604; &#1587;&#1575;&#1604; &#1605;&#1575;&#1604;&#1610; 2014 78.7 &#1605;&#1610;&#1604;&#1610;&#1608;&#1606; &#1583;&#1604;&#1575;&#1585; &#1576;&#1608;&#1583;&#1607; &#1575;&#1587;&#1578; &#1705;&#1607; &#1576;&#1610;&#1588; &#1575;&#1586; 90% &#1583;&#1585;&#1570;&#1605;&#1583;&#1607;&#1575;&#1610; &#1570;&#1606;&#1585;&#1575; 
      &#1591;&#1610; &#1575;&#1610;&#1606; &#1583;&#1608;&#1585;&#1607; &#1588;&#1575;&#1605;&#1604; &#1605;&#1610;&#1588;&#1608;&#1583;. &#1575;&#1585;&#1586;&#1588; &#1575;&#1610;&#1606; &#1588;&#1585;&#1705;&#1578; &#1583;&#1585; &#1576;&#1575;&#1586;&#1575;&#1585; &#1576;&#1608;&#1585;&#1587; </font></span><span style="line-height: 115%" dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">NASDAQ</font></span><span style="line-height: 115%"><font size="14.0pt" face="Traffic"> 
      </font></span><font size="14.0pt" face="Traffic"><span lang="FA">&#1583;&#1585; &#1586;&#1605;&#1575;&#1606; 
      &#1578;&#1607;&#1610;&#1607; &#1575;&#1610;&#1606; &#1711;&#1586;&#1575;&#1585;&#1588; &#1576;&#1610;&#1588; &#1575;&#1586; 3.7 &#1605;&#1610;&#1604;&#1610;&#1575;&#1585;&#1583; &#1583;&#1604;&#1575;&#1585; (&#1605;&#1602;&#1575;&#1610;&#1587;&#1607; &#1576;&#1575; &#1580;&#1605;&#1593; &#1575;&#1585;&#1586;&#1588; &#1576;&#1575;&#1586;&#1575;&#1585; 
      &#1662;&#1578;&#1585;&#1608;&#1588;&#1610;&#1605;&#1610; &#1575;&#1585;&#1575;&#1705; &#1608; &#1582;&#1575;&#1585;&#1705; &#1605;&#1610;&#1604;&#1610;&#1575;&#1585;&#1583; &#1583;&#1604;&#1575;&#1585;) &#1605;&#1610;&#1576;&#1575;&#1588;&#1583;.</span></font>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1607;&#1605;&#1610;&#1606; 
      &#1575;&#1593;&#1583;&#1575;&#1583; &#1608; &#1575;&#1585;&#1602;&#1575;&#1605; &#1576;&#1575;&#1604;&#1575; &#1606;&#1588;&#1575;&#1606; &#1583;&#1607;&#1606;&#1583;&#1607; &#1711;&#1585;&#1583;&#1588; &#1605;&#1575;&#1604;&#1610; &#1587;&#1585;&#1588;&#1575;&#1585; &#1583;&#1585; &#1589;&#1606;&#1593;&#1578; &#1578;&#1608;&#1604;&#1610;&#1583; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610; 
      &#1588;&#1576;&#1610;&#1607; &#1587;&#1575;&#1586;&#1610; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583; &#1705;&#1607; &#1601;&#1585;&#1589;&#1578; &#1607;&#1575;&#1610; &#1576;&#1587;&#1610;&#1575;&#1585;&#1610; &#1580;&#1607;&#1578; &#1587;&#1608;&#1583;&#1570;&#1608;&#1585;&#1610; &#1601;&#1585;&#1570;&#1607;&#1605; &#1605;&#1610;&#1570;&#1608;&#1585;&#1583;.</font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1583;&#1585; 
      &#1583;&#1607;&#1607; &#1575;&#1582;&#1610;&#1585; &#1608; &#1576;&#1575; &#1711;&#1587;&#1578;&#1585;&#1588; &#1605;&#1608;&#1601;&#1602;&#1610;&#1578; &#1570;&#1605;&#1610;&#1586; &#1587;&#1610;&#1587;&#1578;&#1605; &#1593;&#1575;&#1605;&#1604; &#1604;&#1610;&#1606;&#1608;&#1705;&#1587; &#1576;&#1585;&#1575;&#1587;&#1575;&#1587; &#1575;&#1580;&#1575;&#1586;&#1607; &#1606;&#1575;&#1605;&#1607; &#1605;&#1578;&#1606; 
      &#1576;&#1575;&#1586; &#1608; &#1587;&#1662;&#1587; &#1587;&#1610;&#1587;&#1578;&#1605; &#1593;&#1575;&#1605;&#1604; &#1575;&#1606;&#1583;&#1585;&#1608;&#1610;&#1583;. &#1705;&#1607; &#1583;&#1608; &#1662;&#1585;&#1608;&#1688;&#1607; &#1576;&#1587;&#1610;&#1575;&#1585; &#1605;&#1608;&#1601;&#1602; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586; &#1605;&#1610;&#1576;&#1575;&#1588;&#1606;&#1583;. 
      &#1578;&#1608;&#1580;&#1607; &#1576;&#1585;&#1606;&#1575;&#1605;&#1607; &#1606;&#1608;&#1610;&#1587;&#1575;&#1606; &#1608; &#1578;&#1608;&#1587;&#1593;&#1607; &#1583;&#1607;&#1606;&#1583;&#1711;&#1575;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1576;&#1607; &#1605;&#1586;&#1575;&#1610;&#1575;&#1610; &#1575;&#1610;&#1606; &#1585;&#1575;&#1607;&#1705;&#1575;&#1585; &#1606;&#1608; &#1583;&#1585; 
      &#1578;&#1608;&#1587;&#1593;&#1607; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1580;&#1604;&#1576; &#1588;&#1583;&#1607; &#1575;&#1587;&#1578;. &#1583;&#1585; &#1581;&#1575;&#1604; &#1581;&#1575;&#1590;&#1585; &#1583;&#1585; &#1705;&#1604;&#1610;&#1607; &#1581;&#1608;&#1586;&#1607; &#1607;&#1575;&#1610; &#1576;&#1585;&#1606;&#1575;&#1605;&#1607; &#1606;&#1608;&#1610;&#1587;&#1610; 
      &#1605;&#1610;&#1578;&#1608;&#1575;&#1606; &#1576;&#1585;&#1606;&#1575;&#1605;&#1607; &#1607;&#1575;&#1610; &#1605;&#1582;&#1578;&#1604;&#1601;&#1610; &#1705;&#1607; &#1576;&#1575; &#1585;&#1575;&#1607; &#1705;&#1575;&#1585; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586; &#1578;&#1608;&#1587;&#1593;&#1607; &#1610;&#1575;&#1601;&#1578;&#1607; &#1575;&#1606;&#1583; &#1585;&#1575; &#1605;&#1579;&#1575;&#1604; 
      &#1586;&#1583;. &#1583;&#1585; &#1576;&#1587;&#1610;&#1575;&#1585;&#1610; &#1575;&#1586; &#1575;&#1610;&#1606; &#1605;&#1608;&#1575;&#1585;&#1583; &#1581;&#1575;&#1605;&#1610;&#1575;&#1606; &#1575;&#1610;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1548; &#1588;&#1585;&#1705;&#1578; &#1607;&#1575;&#1610; &#1576;&#1586;&#1585;&#1711; &#1589;&#1606;&#1593;&#1578;&#1610;&#1548; 
      &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607;&#1607;&#1575; &#1610;&#1575; &#1583;&#1608;&#1604;&#1578; &#1607;&#1575; &#1605;&#1610;&#1576;&#1575;&#1588;&#1606;&#1583;. &#1608; &#1583;&#1585; &#1576;&#1593;&#1590;&#1610; &#1575;&#1586; &#1605;&#1608;&#1575;&#1585;&#1583; &#1606;&#1610;&#1586; &#1662;&#1585;&#1608;&#1688;&#1607; &#1607;&#1575; &#1576;&#1589;&#1608;&#1585;&#1578; &#1582;&#1608;&#1583; 
      &#1580;&#1608;&#1588; &#1575;&#1586; &#1711;&#1601;&#1578;&#1711;&#1608;&#1607;&#1575;&#1610; &#1608; &#1578;&#1576;&#1575;&#1583;&#1604; &#1606;&#1592;&#1585;&#1607;&#1575; &#1583;&#1585; &#1588;&#1576;&#1705;&#1607; &#1575;&#1610;&#1606;&#1578;&#1585;&#1606;&#1578; &#1576;&#1610;&#1585;&#1608;&#1606; &#1570;&#1605;&#1583;&#1607; &#1575;&#1606;&#1583;.</font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1583;&#1585;&#1582;&#1589;&#1608;&#1589; 
      &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583; &#1608; &#1593;&#1606;&#1575;&#1608;&#1610;&#1606; &#1605;&#1585;&#1578;&#1591; &#1576;&#1607; &#1570;&#1606; &#1606;&#1610;&#1586; &#1605;&#1610;&#1578;&#1608;&#1575;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610; 
      &#1605;&#1582;&#1578;&#1604;&#1601;&#1610; &#1585;&#1575; &#1705;&#1607; &#1583;&#1585; &#1602;&#1575;&#1604;&#1576; &#1662;&#1585;&#1608;&#1688;&#1607; &#1607;&#1575;&#1610; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586; &#1578;&#1608;&#1587;&#1593;&#1607; &#1610;&#1575;&#1601;&#1578;&#1607; &#1575;&#1606;&#1583; &#1605;&#1579;&#1575;&#1604; &#1586;&#1583;.</font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span style="line-height: 115%" dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">ascend</font></span><span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">: 
      &#1610;&#1705; &#1662;&#1585;&#1608;&#1688;&#1607; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586; &#1575;&#1587;&#1578; &#1705;&#1607; &#1578;&#1608;&#1587;&#1591; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607; </font></span><span style="line-height: 115%" dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Carnegie</font></span><span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic"> 
      &#1583;&#1585; &#1662;&#1606;&#1587;&#1610;&#1604;&#1608;&#1575;&#1606;&#1610;&#1575; &#1575;&#1605;&#1585;&#1610;&#1705;&#1575; &#1581;&#1605;&#1575;&#1610;&#1578; &#1605;&#1610;&#1588;&#1608;&#1583;. &#1575;&#1610;&#1606; &#1662;&#1585;&#1608;&#1688;&#1607; &#1575;&#1586; &#1587;&#1575;&#1604; 1978 &#1588;&#1585;&#1608;&#1593; &#1588;&#1583;&#1607; &#1575;&#1587;&#1578; &#1608; </font></span><font size="14.0pt" face="Traffic"><span>&#160;</span><span lang="FA" style="line-height: 115%">&#1578;&#1608;&#1575;&#1606;&#1575;&#1610;&#1610; 
      &#1578;&#1581;&#1604;&#1610;&#1604; &#1605;&#1583;&#1604;&#1607;&#1575;&#1610; &#1594;&#1610;&#1585; &#1582;&#1591;&#1610;&#1548; &#1576;&#1607;&#1610;&#1606;&#1607; &#1587;&#1575;&#1586;&#1610; &#1608; &#1581;&#1604; &#1605;&#1593;&#1575;&#1583;&#1604;&#1575;&#1578; &#1583;&#1610;&#1601;&#1585;&#1575;&#1606;&#1587;&#1610;&#1604; &#1585;&#1575; &#1583;&#1575;&#1585;&#1583;. &#1610;&#1705; 
      &#1578;&#1601;&#1575;&#1608;&#1578; &#1593;&#1605;&#1583;&#1607; &#1575;&#1610;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1580;&#1583;&#1575; &#1705;&#1585;&#1583;&#1606; &#1576;&#1582;&#1588; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586; &#1575;&#1586; &#1578;&#1581;&#1604;&#1610;&#1604;&#1711;&#1585; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583; &#1705;&#1607; &#1575;&#1605;&#1705;&#1575;&#1606; 
      &#1705;&#1575;&#1585; &#1585;&#1575; &#1576;&#1607; &#1589;&#1608;&#1585;&#1578; &#1605;&#1580;&#1586;&#1575; &#1576;&#1585;&#1575;&#1610; &#1576;&#1585;&#1606;&#1575;&#1605;&#1607; &#1606;&#1608;&#1610;&#1587;&#1575;&#1606; &#1605;&#1581;&#1575;&#1587;&#1576;&#1575;&#1578;&#1610; &#1608; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1575;&#1606; &#1601;&#1585;&#1575;&#1607;&#1605; &#1605;&#1610;&#1570;&#1608;&#1585;&#1583;. 
      &#1583;&#1585; &#1581;&#1575;&#1604; &#1581;&#1575;&#1590;&#1585; &#1570;&#1582;&#1585;&#1610;&#1606; &#1606;&#1587;&#1582;&#1607; &#1575;&#1610;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1576;&#1607; &#1607;&#1605;&#1585;&#1575;&#1607; &#1705;&#1578;&#1575;&#1576;&#1582;&#1575;&#1606;&#1607; &#1575;&#1610; &#1575;&#1586; &#1605;&#1583;&#1604;&#1607;&#1575;&#1610; 
      &#1578;&#1593;&#1585;&#1610;&#1601; &#1588;&#1583;&#1607; &#1576;&#1589;&#1608;&#1585;&#1578; &#1585;&#1575;&#1610;&#1711;&#1575;&#1606; &#1575;&#1586; &#1591;&#1585;&#1610;&#1602; &#1575;&#1610;&#1606;&#1578;&#1585;&#1606;&#1578; &#1583;&#1585; &#1583;&#1587;&#1578;&#1585;&#1587; &#1607;&#1605;&#1711;&#1575;&#1606; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583;. &#1575;&#1587;&#1575;&#1587; 
      &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; &#1583;&#1585; &#1575;&#1610;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1578;&#1593;&#1585;&#1610;&#1601; &#1605;&#1593;&#1575;&#1583;&#1604;&#1575;&#1578;&#1610; &#1575;&#1587;&#1578; &#1705;&#1607; &#1575;&#1579;&#1585; &#1610;&#1705; &#1578;&#1580;&#1607;&#1610;&#1586; &#1585;&#1575; &#1576;&#1585; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583; 
      &#1578;&#1593;&#1585;&#1610;&#1601; &#1605;&#1610;&#1705;&#1606;&#1606;&#1583;. &#1578;&#1593;&#1585;&#1610;&#1601; &#1575;&#1610;&#1606; &#1605;&#1593;&#1575;&#1583;&#1604;&#1575;&#1578; &#1578;&#1608;&#1587;&#1591; &#1586;&#1576;&#1575;&#1606; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; &#1608;&#1610;&#1688;&#1607; &#1575;&#1610; &#1705;&#1607; &#1582;&#1575;&#1589; &#1575;&#1610;&#1606; 
      &#1576;&#1585;&#1606;&#1575;&#1605;&#1607; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583;&#1548; &#1589;&#1608;&#1585;&#1578; &#1605;&#1610;&#1711;&#1610;&#1585;&#1583;.</span></font>
    </p>
    <h1 align="justify" dir="RTL">
      <span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">EMSO 
      simulator</font></span><span lang="FA"><font size="14.0pt" face="Traffic">: 
      &#1610;&#1705; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1588;&#1576;&#1610;&#1607; &#1587;&#1575;&#1586; &#1705;&#1607; &#1575;&#1587;&#1575;&#1587; &#1705;&#1575;&#1585; &#1570;&#1606; &#1578;&#1593;&#1585;&#1610;&#1601; &#1605;&#1593;&#1575;&#1583;&#1604;&#1575;&#1578; &#1605;&#1610; &#1576;&#1575;&#1588;&#1583;. &#1607;&#1585; &#1670;&#1606;&#1583; &#1575;&#1610;&#1606; 
      &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586; &#1576;&#1607; &#1588;&#1605;&#1575;&#1585; &#1606;&#1605;&#1610;&#1570;&#1610;&#1583; &#1575;&#1605;&#1575; &#1585;&#1575;&#1610;&#1711;&#1575;&#1606; &#1575;&#1587;&#1578; &#1608; &#1605;&#1580;&#1605;&#1608;&#1593;&#1607; &#1605;&#1583;&#1604;&#1607;&#1575;&#1610; &#1570;&#1606; &#1576;&#1589;&#1608;&#1585;&#1578; 
      &#1570;&#1586;&#1575;&#1583; &#1580;&#1607;&#1578; &#1575;&#1587;&#1578;&#1601;&#1575;&#1583;&#1607; &#1605;&#1606;&#1578;&#1588;&#1585; &#1605;&#1610;&#1711;&#1585;&#1583;&#1583;. &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1578;&#1608;&#1575;&#1606;&#1575;&#1610;&#1610; &#1578;&#1581;&#1604;&#1610;&#1604; &#1583;&#1610;&#1606;&#1575;&#1605;&#1610;&#1705;&#1610;&#1548; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; 
      &#1587;&#1610;&#1587;&#1578;&#1605; &#1607;&#1575;&#1610; &#1705;&#1606;&#1578;&#1585;&#1604; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583; &#1585;&#1575; &#1583;&#1575;&#1585;&#1575; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583;. &#1581;&#1575;&#1605;&#1610; &#1575;&#1610;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607; </font></span><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Federal 
      University of Rio Grande do Sul</font></span><span lang="FA"><font size="14.0pt" face="Traffic"> 
      &#1583;&#1585; &#1705;&#1588;&#1608;&#1585; &#1576;&#1585;&#1586;&#1610;&#1604; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583;.</font></span>
    </h1>
    <h1 align="justify" dir="RTL">
      <span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">DWSIM</font></span><span lang="FA"><font size="14.0pt" face="Traffic">: 
      &#1610;&#1705; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1605;&#1587;&#1578;&#1602;&#1604; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583; &#1705;&#1607; &#1578;&#1608;&#1587;&#1591; &#1583;&#1608; &#1576;&#1585;&#1606;&#1575;&#1605;&#1607; &#1606;&#1608;&#1610;&#1587; &#1578;&#1608;&#1587;&#1593;&#1607; &#1610;&#1575;&#1601;&#1578;&#1607; &#1608; 
      &#1662;&#1588;&#1578;&#1610;&#1576;&#1575;&#1606;&#1610; &#1605;&#1610;&#1588;&#1608;&#1583;. &#1575;&#1610;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1576;&#1608;&#1587;&#1610;&#1604;&#1607; &#1586;&#1576;&#1575;&#1606; &#1576;&#1585;&#1606;&#1575;&#1605;&#1607; &#1606;&#1608;&#1610;&#1587;&#1610; </font></span><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">VB.NET</font></span><span lang="FA"><font size="14.0pt" face="Traffic"> 
      &#1606;&#1608;&#1588;&#1578;&#1607; &#1588;&#1583;&#1607; &#1575;&#1587;&#1578;.</font></span>
    </h1>
    <h1 align="justify" dir="RTL">
      <span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">OpenModelica</font></span><span lang="FA"><font size="14.0pt" face="Traffic">: 
      &#1610;&#1705; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; &#1593;&#1605;&#1608;&#1605;&#1610; &#1580;&#1607;&#1578; &#1578;&#1593;&#1585;&#1610;&#1601; &#1605;&#1583;&#1604;&#1607;&#1575;&#1610; &#1585;&#1610;&#1575;&#1590;&#1610; &#1608; &#1578;&#1581;&#1604;&#1610;&#1604; 
      &#1605;&#1593;&#1575;&#1583;&#1604;&#1575;&#1578; &#1581;&#1575;&#1589;&#1604;.</font></span>
    </h1>
    <h1 align="justify" dir="RTL">
      <span lang="FA"><font size="14.0pt" face="Traffic">&#1576;&#1575;&#1608;&#1580;&#1608;&#1583; &#1578;&#1608;&#1587;&#1593;&#1607; &#1588;&#1711;&#1585;&#1601; &#1606;&#1585;&#1605; 
      &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1548; &#1575;&#1610;&#1606; &#1583;&#1575;&#1606;&#1588; &#1607;&#1606;&#1608;&#1586; &#1606;&#1608; &#1608; &#1576;&#1583;&#1610;&#1593; &#1580;&#1604;&#1608;&#1607; &#1605;&#1610;&#1705;&#1606;&#1583; &#1604;&#1584;&#1575; &#1583;&#1585; &#1587;&#1575;&#1604;&#1607;&#1575;&#1610; &#1575;&#1582;&#1610;&#1585; &#1605;&#1602;&#1575;&#1604;&#1575;&#1578; &#1608; 
      &#1662;&#1575;&#1610;&#1575;&#1606; &#1606;&#1575;&#1605;&#1607; &#1607;&#1575;&#1610; &#1576;&#1587;&#1610;&#1575;&#1585;&#1610; &#1583;&#1585; &#1586;&#1605;&#1610;&#1606;&#1607; &#1585;&#1608;&#1588;&#1607;&#1575;&#1610; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; &#1583;&#1585; &#1587;&#1591;&#1608;&#1581; &#1605;&#1582;&#1578;&#1604;&#1601; &#1605;&#1606;&#1578;&#1588;&#1585; &#1588;&#1583;&#1607; 
      &#1575;&#1587;&#1578;. &#1662;&#1575;&#1610;&#1575;&#1606; &#1606;&#1575;&#1605;&#1607; &#1662;&#1585;&#1608;&#1601;&#1587;&#1608;&#1585; </font></span><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">David 
      Broman</font></span><span lang="FA"><font size="14.0pt" face="Traffic"> 
      &#1587;&#1575;&#1604; 2010 &#1580;&#1607;&#1578; &#1575;&#1582;&#1584; &#1583;&#1705;&#1578;&#1585;&#1610; &#1593;&#1604;&#1608;&#1605; &#1608; &#1578;&#1705;&#1606;&#1608;&#1604;&#1608;&#1688;&#1610;&#1548; &#1578;&#1604;&#1575;&#1588;&#1610; &#1575;&#1587;&#1578; &#1580;&#1607;&#1578; &#1578;&#1608;&#1587;&#1593;&#1607; &#1610;&#1705; &#1586;&#1576;&#1575;&#1606; 
      &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; &#1662;&#1688;&#1608;&#1607;&#1588;&#1610; &#1608; &#1587;&#1591;&#1581; &#1576;&#1575;&#1604;&#1575; &#1576;&#1589;&#1608;&#1585;&#1578;&#1610; &#1705;&#1607; &#1583;&#1585; &#1593;&#1610;&#1606; &#1587;&#1575;&#1583;&#1607; &#1608; &#1587;&#1576;&#1705; &#1576;&#1608;&#1583;&#1606; &#1578;&#1608;&#1575;&#1606;&#1575;&#1610;&#1610; &#1607;&#1575;&#1610; 
      &#1586;&#1576;&#1575;&#1606; </font></span><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Modelica</font></span><span lang="FA"><font size="14.0pt" face="Traffic"> 
      &#1585;&#1575; &#1583;&#1585; &#1578;&#1593;&#1585;&#1610;&#1601; &#1605;&#1583;&#1604;&#1607;&#1575; &#1582;&#1608;&#1583; &#1583;&#1575;&#1588;&#1578;&#1607; &#1576;&#1575;&#1588;&#1583;&#1548; &#1605;&#1583;&#1604;&#1607;&#1575;&#1610; &#1575;&#1606;&#1593;&#1591;&#1575;&#1601; &#1662;&#1584;&#1610;&#1585; &#1608; &#1602;&#1575;&#1576;&#1604; &#1575;&#1587;&#1578;&#1601;&#1575;&#1583;&#1607; &#1605;&#1580;&#1583;&#1583; 
      &#1576;&#1575;&#1588;&#1606;&#1583;.</font></span><font size="14.0pt" face="Traffic"><span>&#160; 
      </span><span lang="FA">&#1581;&#1575;&#1589;&#1604; &#1705;&#1575;&#1585; &#1605;&#1593;&#1585;&#1601;&#1610; &#1586;&#1576;&#1575;&#1606; </span></font><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">MKL</font></span><span lang="FA"><font size="14.0pt" face="Traffic"> 
      &#1605;&#1610;&#1576;&#1575;&#1588;&#1583; &#1607;&#1605;&#1670;&#1606;&#1610;&#1606;&#1548; </font></span><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Modelyze 
      </font></span><span><font size="14.0pt" face="Traffic">&#160;</font></span><font size="14.0pt" face="Traffic"><span lang="FA">&#1610;&#1705; 
      &#1605;&#1578;&#1585;&#1580;&#1605; &#1570;&#1586;&#1575;&#1583; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583; &#1705;&#1607; &#1576;&#1585;&#1575;&#1587;&#1575;&#1587; &#1607;&#1605;&#1610;&#1606; &#1575;&#1610;&#1583;&#1607; &#1591;&#1585;&#1575;&#1581;&#1610; &#1588;&#1583;&#1607; &#1575;&#1587;&#1578;.</span></font>
    </h1>
    <h1 align="justify" dir="RTL">
      <span lang="FA"><font size="14.0pt" face="Traffic">&#1606;&#1605;&#1608;&#1606;&#1607; &#1583;&#1610;&#1711;&#1585;&#1610; &#1575;&#1586; &#1578;&#1604;&#1575;&#1588;&#1607;&#1575; 
      &#1662;&#1585;&#1601;&#1587;&#1608;&#1585; </font></span><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">GEORGE 
      GIORGIDZE</font></span><span><font size="14.0pt" face="Traffic"> </font></span><font size="14.0pt" face="Traffic"><span>&#160;</span><span lang="FA">&#1575;&#1586; 
      &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607; &#1606;&#1575;&#1578;&#1610;&#1606;&#1711;&#1607;&#1575;&#1605; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583; &#1705;&#1607; &#1605;&#1606;&#1580;&#1585; &#1576;&#1607; &#1591;&#1585;&#1575;&#1581;&#1610; &#1586;&#1576;&#1575;&#1606; </span></font><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Hydra</font></span><span lang="FA"><font size="14.0pt" face="Traffic"> 
      &#1588;&#1583;&#1607; &#1575;&#1587;&#1578;. &#1575;&#1610;&#1606; &#1586;&#1576;&#1575;&#1606; &#1576;&#1589;&#1608;&#1585;&#1578; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586; &#1575;&#1586; &#1591;&#1585;&#1610;&#1602; &#1575;&#1610;&#1606;&#1578;&#1585;&#1606;&#1578; &#1583;&#1585; &#1583;&#1587;&#1578;&#1585;&#1587; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583;.</font></span>
    </h1>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1583;&#1575;&#1606;&#1588;&#1705;&#1583;&#1607; 
      &#1607;&#1575; &#1608; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607;&#1607;&#1575; &#1605;&#1610;&#1578;&#1608;&#1575;&#1606;&#1606;&#1583; &#1576;&#1575; &#1578;&#1593;&#1585;&#1610;&#1601; &#1662;&#1585;&#1608;&#1688;&#1607; &#1607;&#1575;&#1610; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1610; &#1705;&#1575;&#1585;&#1576;&#1585;&#1583;&#1610; &#1583;&#1585; &#1581;&#1608;&#1586;&#1607; 
      &#1607;&#1575;&#1610; &#1601;&#1585;&#1575; &#1585;&#1588;&#1578;&#1607; &#1575;&#1610; &#1670;&#1575;&#1585;&#1670;&#1608;&#1576;&#1610; &#1605;&#1588;&#1582;&#1589; &#1580;&#1607;&#1578; &#1578;&#1593;&#1585;&#1610;&#1601; &#1662;&#1585;&#1608;&#1688;&#1607; &#1607;&#1575;&#1610; &#1605;&#1578;&#1606;&#1608;&#1593; &#1583;&#1575;&#1606;&#1588;&#1580;&#1608;&#1610;&#1610; &#1583;&#1585; &#1587;&#1591;&#1608;&#1581; 
      &#1605;&#1582;&#1578;&#1604;&#1601; &#1578;&#1581;&#1589;&#1610;&#1604;&#1610; &#1601;&#1585;&#1575;&#1607;&#1605; &#1570;&#1608;&#1585;&#1583;. &#1576;&#1585;&#1570;&#1610;&#1606;&#1583; &#1662;&#1585;&#1608;&#1688;&#1607; &#1607;&#1575;&#1610; &#1605;&#1582;&#1578;&#1604;&#1601; &#1583;&#1585; &#1605;&#1610;&#1575;&#1606; &#1605;&#1583;&#1578; &#1578;&#1608;&#1587;&#1593;&#1607; &#1610;&#1705; &#1606;&#1585;&#1605; 
      &#1575;&#1601;&#1586;&#1575;&#1585; &#1582;&#1575;&#1589; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583;. &#1605;&#1605;&#1575;&#1606;&#1593;&#1578; &#1575;&#1586; &#1583;&#1608;&#1576;&#1575;&#1585;&#1607; &#1705;&#1575;&#1585;&#1610; &#1608; &#1578;&#1705;&#1585;&#1575;&#1585; &#1662;&#1585;&#1608;&#1688;&#1607; &#1607;&#1575;&#1610; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1610; &#1548; 
      &#1575;&#1606;&#1578;&#1602;&#1575;&#1604; &#1583;&#1575;&#1606;&#1588; &#1575;&#1586; &#1591;&#1585;&#1610;&#1602; &#1705;&#1583;&#1607;&#1575;&#1610; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1610;&#1548; &#1578;&#1602;&#1608;&#1610;&#1578; &#1585;&#1608;&#1581;&#1610;&#1607; &#1662;&#1688;&#1608;&#1607;&#1588;&#1610; &#1608; &#1705;&#1575;&#1585;&#1711;&#1585;&#1608;&#1607;&#1610; &#1575;&#1586; 
      &#1583;&#1610;&#1711;&#1585; &#1605;&#1586;&#1575;&#1610;&#1575;&#1610; &#1587;&#1585;&#1605;&#1575;&#1610;&#1607; &#1711;&#1586;&#1575;&#1585;&#1610; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607;&#1607;&#1575; &#1608; &#1605;&#1585;&#1575;&#1705;&#1586; &#1570;&#1605;&#1608;&#1586;&#1588;&#1610; &#1608; &#1662;&#1688;&#1608;&#1607;&#1588;&#1610; &#1583;&#1585; &#1606;&#1585;&#1605; 
      &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583;. &#1575;&#1586; &#1591;&#1585;&#1601; &#1583;&#1610;&#1711;&#1585; &#1589;&#1606;&#1593;&#1578; &#1606;&#1610;&#1586; &#1605;&#1610;&#1578;&#1608;&#1575;&#1606;&#1583; &#1607;&#1605;&#1711;&#1575;&#1605; &#1576;&#1575; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607;&#1607;&#1575; 
      &#1575;&#1586; &#1605;&#1586;&#1575;&#1610;&#1575;&#1610; &#1578;&#1608;&#1587;&#1593;&#1607; &#1670;&#1606;&#1610;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610;&#1610; &#1583;&#1585; &#1587;&#1591;&#1608;&#1581; &#1605;&#1582;&#1578;&#1604;&#1601; &#1576;&#1607;&#1585;&#1607; &#1576;&#1585;&#1583;&#1548; &#1610;&#1705;&#1610; &#1575;&#1586; 
      &#1705;&#1575;&#1585;&#1576;&#1585;&#1583;&#1607;&#1575;&#1610; &#1605;&#1587;&#1578;&#1602;&#1610;&#1605; &#1575;&#1610;&#1606; &#1606;&#1585;&#1605;</font></span><font size="14.0pt" face="Traffic"><span>&#160; 
      </span><span lang="FA" style="line-height: 115%">&#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1548; &#1578;&#1608;&#1604;&#1610;&#1583; &#1575;&#1576;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610; 
      &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1610; &#1705;&#1605;&#1705; &#1570;&#1605;&#1608;&#1586;&#1588;&#1610; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583; &#1705;&#1607; &#1605;&#1610;&#1578;&#1608;&#1575;&#1606;&#1606;&#1583; &#1583;&#1585; &#1570;&#1605;&#1608;&#1586;&#1588;&#1711;&#1575;&#1607;&#1607;&#1575;&#1610; &#1608;&#1575;&#1576;&#1587;&#1591;&#1607; &#1576;&#1607; &#1589;&#1606;&#1593;&#1578; 
      &#1606;&#1601;&#1578; &#1580;&#1607;&#1578; &#1570;&#1605;&#1608;&#1586;&#1588; &#1662;&#1585;&#1587;&#1606;&#1604; &#1588;&#1575;&#1594;&#1604; &#1608; &#1705;&#1575;&#1585;&#1570;&#1605;&#1608;&#1586;&#1575;&#1606; &#1575;&#1587;&#1578;&#1601;&#1575;&#1583;&#1607; &#1711;&#1585;&#1583;&#1606;&#1583;.</span></font>
    </p>
    <p align="justify" class="MsoNormal">
      <span lang="FA" style="line-height: 115%" dir="RTL"><font size="14.0pt" face="Traffic">&#1591;&#1585;&#1575;&#1581;&#1610; 
      &#1605;&#1575;&#1688;&#1608;&#1604;&#1607;&#1575;&#1610; &#1570;&#1605;&#1608;&#1586;&#1588;&#1610; &#1575;&#1582;&#1578;&#1589;&#1575;&#1589;&#1610; &#1580;&#1607;&#1578; &#1575;&#1585;&#1575;&#1574;&#1607; &#1605;&#1579;&#1575;&#1604;&#1607;&#1575;&#1610; &#1593;&#1583;&#1583;&#1610;&#1548; &#1606;&#1605;&#1575;&#1610;&#1588; &#1705;&#1575;&#1585;&#1705;&#1585;&#1583; &#1610;&#1705; &#1578;&#1580;&#1607;&#1610;&#1586; &#1610;&#1575; 
      &#1605;&#1580;&#1605;&#1608;&#1593;&#1607; &#1575;&#1610; &#1575;&#1586; &#1578;&#1580;&#1607;&#1610;&#1586;&#1575;&#1578; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1610; &#1608; &#1593;&#1606;&#1575;&#1608;&#1610;&#1606;&#1610; &#1575;&#1586; &#1575;&#1610;&#1606; &#1576;&#1589;&#1608;&#1585;&#1578; &#1587;&#1601;&#1575;&#1585;&#1588;&#1610; &#1607;&#1605;&#1585;&#1575;&#1607; &#1576;&#1575; 
      &#1578;&#1608;&#1590;&#1610;&#1581;&#1575;&#1578; &#1601;&#1575;&#1585;&#1587;&#1610; &#1605;&#1610;&#1578;&#1608;&#1575;&#1606;&#1583; &#1705;&#1605;&#1705; &#1588;&#1575;&#1610;&#1575;&#1606;&#1610; &#1583;&#1585; &#1570;&#1605;&#1608;&#1586;&#1588; &#1605;&#1601;&#1575;&#1607;&#1610;&#1605; &#1578;&#1581;&#1604;&#1610;&#1604;&#1610;&#1548; &#1585;&#1608;&#1575;&#1576;&#1591; 
      &#1578;&#1585;&#1605;&#1608;&#1583;&#1610;&#1606;&#1575;&#1605;&#1610;&#1705;&#1610; &#1608; &#1575;&#1579;&#1585;&#1575;&#1578; &#1662;&#1575;&#1585;&#1575;&#1605;&#1578;&#1585;&#1607;&#1575;&#1610; &#1582;&#1575;&#1585;&#1580;&#1610; &#1576;&#1585; &#1705;&#1575;&#1585;&#1705;&#1585;&#1583; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583; &#1608; &#1578;&#1580;&#1607;&#1610;&#1586;&#1575;&#1578; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1610; 
      &#1606;&#1605;&#1575;&#1610;&#1583;. &#1601;&#1602;&#1583;&#1575;&#1606; &#1670;&#1606;&#1610;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610;&#1610; &#1583;&#1585; &#1581;&#1575;&#1604; &#1581;&#1575;&#1590;&#1585; &#1705;&#1604;&#1575;&#1587;&#1607;&#1575;&#1610; &#1570;&#1605;&#1608;&#1586;&#1588;&#1610; &#1585;&#1575; &#1601;&#1575;&#1602;&#1583; 
      &#1575;&#1605;&#1705;&#1575;&#1606;&#1575;&#1578; &#1604;&#1575;&#1586;&#1605; &#1580;&#1607;&#1578; &#1575;&#1585;&#1575;&#1574;&#1607; &#1605;&#1579;&#1575;&#1604;&#1607;&#1575;&#1610; &#1593;&#1583;&#1583;&#1610; &#1605;&#1610;&#1606;&#1605;&#1575;&#1610;&#1583; &#1586;&#1610;&#1585;&#1575; &#1583;&#1585; &#1605;&#1608;&#1585;&#1583; &#1578;&#1580;&#1607;&#1610;&#1586;&#1575;&#1578; &#1589;&#1606;&#1593;&#1578;&#1610; 
      &#1578;&#1593;&#1583;&#1575;&#1583; &#1662;&#1575;&#1585;&#1575;&#1605;&#1578;&#1585; &#1607;&#1575; &#1608; &#1605;&#1578;&#1594;&#1610;&#1610;&#1585;&#1607;&#1575; &#1608; &#1581;&#1580;&#1605; &#1605;&#1581;&#1575;&#1587;&#1576;&#1575;&#1578; &#1604;&#1575;&#1586;&#1605; &#1580;&#1607;&#1578; &#1585;&#1587;&#1610;&#1583;&#1606; &#1576;&#1607; &#1610;&#1705; &#1606;&#1578;&#1610;&#1580;&#1607; 
      &#1602;&#1575;&#1576;&#1604; &#1602;&#1576;&#1608;&#1604; &#1576;&#1610;&#1588; &#1575;&#1586; &#1581;&#1608;&#1589;&#1604;&#1607; &#1583;&#1608;&#1585;&#1607; &#1607;&#1575;&#1610; &#1705;&#1608;&#1578;&#1575;&#1607; &#1605;&#1583;&#1578;&#1610; &#1575;&#1587;&#1578; &#1705;&#1607; &#1580;&#1607;&#1578; &#1570;&#1588;&#1606;&#1575;&#1610;&#1610; &#1662;&#1585;&#1587;&#1606;&#1604; 
      &#1576;&#1585;&#1711;&#1586;&#1575;&#1585; &#1605;&#1610;&#1711;&#1585;&#1583;&#1583;. </font></span>
    </p>
    <p align="justify" class="MsoNormal" style="margin-right: 36.0pt" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1605;&#1586;&#1575;&#1610;&#1575;&#1548; 
      &#1705;&#1575;&#1585;&#1576;&#1585;&#1583;&#1607;&#1575; &#1576;&#1585;&#1575;&#1610; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607;&#1548; &#1589;&#1606;&#1593;&#1578;&#1548; &#1575;&#1587;&#1575;&#1578;&#1610;&#1583;&#1548; &#1662;&#1688;&#1608;&#1607;&#1588;&#1711;&#1585;&#1575;&#1606; &#1608; &#1583;&#1575;&#1606;&#1588;&#1580;&#1608;&#1610;&#1575;&#1606;.</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="margin-right: 36.0pt" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1585;&#1608;&#1588;&#1607;&#1575;&#1610; 
      &#1605;&#1582;&#1578;&#1604;&#1601; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1607;&#1575; &#1608; &#1578;&#1580;&#1607;&#1610;&#1586;&#1575;&#1578; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1610; &#1583;&#1585; &#1589;&#1606;&#1593;&#1578; &#1606;&#1601;&#1578;&#1548; &#1711;&#1575;&#1586; &#1608; &#1662;&#1578;&#1585;&#1608;&#1588;&#1610;&#1605;&#1610;.</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="margin-right: 36.0pt" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1575;&#1607;&#1605;&#1610;&#1578; 
      &#1578;&#1608;&#1580;&#1607; &#1576;&#1607; &#1705;&#1583;&#1607;&#1575;&#1610; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586; &#1583;&#1585; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607;&#1607;&#1575;&#1548; &#1605;&#1585;&#1575;&#1705;&#1586; &#1570;&#1605;&#1608;&#1586;&#1588;&#1610; &#1608; &#1662;&#1688;&#1608;&#1607;&#1588;&#1610;.</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="margin-right: 36.0pt" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1575;&#1576;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610; 
      &#1604;&#1575;&#1586;&#1605; &#1580;&#1607;&#1578; &#1662;&#1610;&#1575;&#1583;&#1607; &#1587;&#1575;&#1586;&#1610; &#1591;&#1585;&#1581; (&#1586;&#1576;&#1575;&#1606; &#1576;&#1585;&#1606;&#1575;&#1605;&#1607; &#1606;&#1608;&#1610;&#1587;&#1610;&#1548; &#1587;&#1575;&#1610;&#1578;&#1607;&#1575; &#1608; &#1575;&#1576;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610; &#1576;&#1607; &#1575;&#1588;&#1578;&#1585;&#1575;&#1705; 
      &#1711;&#1584;&#1575;&#1585;&#1610;) </font></span>
    </p>
    <p align="justify" class="MsoNormal" style="margin-right: 36.0pt" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1605;&#1593;&#1585;&#1601;&#1610; 
      &#1578;&#1604;&#1575;&#1588;&#1607;&#1575;&#1610; &#1589;&#1608;&#1585;&#1578; &#1711;&#1585;&#1601;&#1578;&#1607; &#1608; &#1583;&#1593;&#1608;&#1578; &#1575;&#1586; &#1575;&#1587;&#1575;&#1578;&#1610;&#1583; &#1608; &#1662;&#1688;&#1608;&#1607;&#1588;&#1711;&#1585;&#1575;&#1606; &#1580;&#1607;&#1578; &#1605;&#1588;&#1575;&#1585;&#1705;&#1578; &#1583;&#1585; &#1591;&#1585;&#1581;.</font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1575;&#1607;&#1583;&#1575;&#1601;:</font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1586;&#1605;&#1575;&#1606;:</font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1607;&#1586;&#1610;&#1606;&#1607;:</font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#160;</font></span>
    </p>
    <p align="justify" class="MsoNormal">
      <span style="line-height: 115%"><font size="14.0pt" face="Tahoma,sans-serif">Training 
      workshop title:</font></span>
    </p>
    <p align="justify" class="MsoNormal">
      <span style="line-height: 115%"><font size="14.0pt" face="Tahoma,sans-serif">Open 
      source modeling of process equipments in oil, gas and petrochemical 
      industries</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">&#160;</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">1.2 </font></span><span><font size="14.0pt" face="Tahoma,sans-serif">Equation-Based 
      Object-Oriented Languages</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">In the previous 
      section we gave an introduction to continuous-time system modeling and</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">simulation. Designing 
      languages for continuous-time systems is not new and one of the earliest 
      initiatives was the Continuous System Simulation Language (CSSL) speci&#64257;ed</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">in 1967 [11]. 
      Derivations of CSSL are all based on state-space descriptions where the</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">underlying 
      mathematical description is an ODE [35]. General-purpose simulation tools</font></span><span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">,</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">e.g., Simulink [92], 
      using block diagrams and causal connections, have now dominated</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">the area for many 
      years. Block diagrams make it possible to graphically model ODEs and</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">the software tool is 
      then used for performing the numerical simulation</font></span><span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">.</font></span><span><font size="14.0pt" face="Tahoma,sans-serif"> 
      In the 1960&#8217;s, the &#64257;rst object-oriented language was designed with the 
      initial purpose</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">of discrete 
      event-based modeling and simulation. This language, Simula [44], founded</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">the fundamental 
      concepts of object-orientation and object-oriented languages. The fun</font></span><span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">-</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">damental principles 
      of object-orientedmodeling languages for continuous-timemodeling</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">and simulation have 
      been around for about 30 years. According to Cellier [36], this started</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">with the pioneering 
      work explored in two separate PhD theses by Hilding Elmqvist [47</font></span><span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">]</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">and Tom Runge</font></span><span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">.</font></span><span><font size="14.0pt" face="Tahoma,sans-serif"> 
      Several languages have been developed during the years with the common 
      properties</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">of physical modeling 
      using equation systems. Today the state of the art within multi</font></span><span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">-</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">domain physical 
      modeling (e.g., containing mechanical, electrical, hydraulic, thermal</font></span><span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">,</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">&#64258;uid, and control 
      components) is Modelica [104]. Other examples of languages with</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">similar modeling and 
      simulation capabilities are gPROMS [13, 115] for chemical engi</font></span><span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">-</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">neering and VHDL-AMS 
      [40, 72] a hardware description language (HDL) with analog</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">and mixed-signal 
      extensions</font></span><span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">.</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">However, not until 
      recently has a common name for this category of languages ap</font></span><span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">-</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">peared. We call this 
      language category equation-based object-oriented (EOO) languages2</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">.</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">The exact meaning of 
      this name can be a subject for discussion, but we propose the fol</font></span><span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">-</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">lowing de&#64257;nition</font></span><span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">:</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">De&#64257;nition 1.2.1 
      (Equation-based object-oriented (EOO) language).</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">An equation-based 
      object-oriented (EOO) language is a domain-speci&#64257;c language used</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">for modeling the 
      interaction between objects, by utilizing mathematical equations to pro-</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">vide an acausal 
      description of behavior.</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">This informal 
      de&#64257;nition includes the following vague terms:</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">&#8226; Domain-speci&#64257;c 
      language</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">&#8226; Objects</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">&#8226; Mathematical 
      equations and acausality</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">In the rest of this 
      section, we will discuss and clarify these terms.</font></span>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span lang="FA" dir="RTL"><font size="14.0pt" face="Traffic">*******************************</font></span>
    </p>
    <p align="justify" dir="RTL">
      <span lang="FA"><font size="14.0pt" face="Traffic">&#1576;&#1607; &#1591;&#1608;&#1585; &#1705;&#1604;&#1610; &#1583;&#1608; &#1585;&#1608;&#1588; 
      &#1575;&#1589;&#1604;&#1610; &#1583;&#1585; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; &#1610;&#1705; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583; &#1601;&#1610;&#1586;&#1610;&#1705;&#1610; &#1605;&#1610;&#1578;&#1608;&#1575;&#1606; &#1583;&#1606;&#1576;&#1575;&#1604; &#1606;&#1605;&#1608;&#1583;. &#1585;&#1608;&#1588; &#1575;&#1608;&#1604; &#1705;&#1607; &#1587;&#1575;&#1576;&#1602;&#1607; 
      &#1576;&#1610;&#1588;&#1578;&#1585;&#1610; &#1583;&#1575;&#1585;&#1583; &#1608; &#1575;&#1587;&#1575;&#1587; &#1705;&#1575;&#1585; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610;&#1610; &#1605;&#1575;&#1606;&#1606;&#1583; </font></span><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">HySys</font></span><span lang="FA"><font size="14.0pt" face="Traffic">&#1548; 
      </font></span><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Aspen 
      Plus</font></span><span lang="FA"><font size="14.0pt" face="Traffic"> &#1608; </font></span><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Matlab 
      Simulink</font></span><span lang="FA"><font size="14.0pt" face="Traffic"> 
      &#1605;&#1610;&#1576;&#1575;&#1588;&#1583;&#1548; &#1585;&#1608;&#1588; </font></span><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Sequential</font></span><span><font size="14.0pt" face="Traffic"> 
      </font></span><font size="14.0pt" face="Traffic"><span lang="FA">&#1610;&#1575; 
      &#1605;&#1585;&#1581;&#1604;&#1607; &#1575;&#1610; &#1583;&#1585; &#1605;&#1583;&#1604; &#1587;&#1575;&#1586;&#1610; &#1575;&#1587;&#1578;. &#1583;&#1585; &#1575;&#1610;&#1606; &#1585;&#1608;&#1588; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583; &#1601;&#1610;&#1586;&#1610;&#1705;&#1610; &#1576;&#1607; &#1576;&#1582;&#1588;&#1607;&#1575;&#1610;&#1610; (</span></font><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Block</font></span><span lang="FA"><font size="14.0pt" face="Traffic">) 
      &#1578;&#1602;&#1587;&#1610;&#1605; &#1605;&#1610;&#1588;&#1608;&#1583; &#1705;&#1607; &#1607;&#1585; &#1576;&#1582;&#1588; &#1578;&#1608;&#1575;&#1606;&#1575;&#1610;&#1610; &#1605;&#1581;&#1575;&#1587;&#1576;&#1607; &#1605;&#1602;&#1575;&#1583;&#1610;&#1585; &#1582;&#1585;&#1608;&#1580;&#1610; &#1585;&#1575; &#1576;&#1575; &#1605;&#1593;&#1604;&#1608;&#1605; &#1576;&#1608;&#1583;&#1606; &#1605;&#1602;&#1583;&#1575;&#1585; 
      &#1608;&#1585;&#1608;&#1583;&#1610; &#1583;&#1575;&#1585;&#1575; &#1605;&#1610;&#1576;&#1575;&#1588;&#1583;. &#1576;&#1606;&#1575;&#1576;&#1585;&#1575;&#1610;&#1606; &#1576;&#1575; &#1581;&#1604; &#1602;&#1583;&#1605; &#1576;&#1607; &#1602;&#1583;&#1605; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1548; &#1575;&#1586; &#1575;&#1608;&#1604;&#1610;&#1606; &#1608;&#1585;&#1608;&#1583;&#1610; 
      &#1605;&#1593;&#1604;&#1608;&#1605; &#1605;&#1610;&#1578;&#1608;&#1575;&#1606; &#1576;&#1607; &#1591;&#1608;&#1585; &#1605;&#1580;&#1586;&#1575; &#1607;&#1585; &#1576;&#1582;&#1588; &#1585;&#1575; &#1576;&#1607; &#1578;&#1606;&#1607;&#1575;&#1610;&#1610; &#1576;&#1585;&#1575;&#1610; &#1605;&#1581;&#1575;&#1587;&#1576;&#1607; &#1605;&#1602;&#1583;&#1575;&#1585; &#1582;&#1585;&#1608;&#1580;&#1610; 
      &#1607;&#1605;&#1575;&#1606; &#1576;&#1582;&#1588; &#1575;&#1587;&#1578;&#1601;&#1575;&#1583;&#1607; &#1606;&#1605;&#1608;&#1583;. &#1575;&#1610;&#1606; &#1585;&#1608;&#1588; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; &#1576;&#1575;&#1593;&#1579; &#1576;&#1607; &#1581;&#1583;&#1575;&#1602;&#1604; &#1585;&#1587;&#1575;&#1606;&#1583;&#1606; &#1605;&#1602;&#1583;&#1575;&#1585; &#1581;&#1575;&#1601;&#1592;&#1607; 
      &#1605;&#1589;&#1585;&#1601;&#1610; &#1578;&#1608;&#1587;&#1591; &#1578;&#1581;&#1604;&#1610;&#1604;&#1711;&#1585; (</font></span><span dir="LTR"><font size="14.0pt" face="Tahoma,sans-serif">Solver</font></span><span lang="FA"><font size="14.0pt" face="Traffic">) 
      &#1583;&#1585; &#1586;&#1605;&#1575;&#1606; &#1581;&#1604;&#1548; &#1583;&#1585; &#1605;&#1608;&#1585;&#1583; &#1605;&#1587;&#1575;&#1574;&#1604;&#1610; &#1605;&#1610; &#1711;&#1585;&#1583;&#1583; &#1705;&#1607; &#1605;&#1602;&#1575;&#1583;&#1610;&#1585; &#1608;&#1585;&#1608;&#1583;&#1610; &#1576;&#1607; &#1607;&#1585; &#1576;&#1582;&#1588;&#1548; &#1575;&#1586; &#1605;&#1602;&#1583;&#1575;&#1610;&#1585; 
      &#1582;&#1585;&#1608;&#1580;&#1610; &#1605;&#1587;&#1578;&#1602;&#1604; &#1576;&#1575;&#1588;&#1606;&#1583; (&#1601;&#1575;&#1602;&#1583; &#1601;&#1610;&#1583;&#1576;&#1705;). &#1583;&#1585; &#1581;&#1602;&#1610;&#1602;&#1578; &#1583;&#1585; &#1575;&#1610;&#1606; &#1585;&#1608;&#1588; &#1576;&#1582;&#1588;&#1607;&#1575; &#1593;&#1604;&#1575;&#1608;&#1607; &#1576;&#1585; &#1578;&#1608;&#1589;&#1610;&#1601; 
      &#1588;&#1585;&#1575;&#1610;&#1591; &#1601;&#1610;&#1586;&#1610;&#1705;&#1610; &#1605;&#1583;&#1604; &#1583;&#1585; &#1610;&#1705; &#1576;&#1585;&#1606;&#1575;&#1605;&#1607; &#1705;&#1575;&#1605;&#1662;&#1610;&#1608;&#1578;&#1585;&#1610;&#1548; &#1585;&#1608;&#1588; &#1581;&#1604; &#1585;&#1575; &#1576;&#1585;&#1575;&#1610; &#1576;&#1607; &#1583;&#1587;&#1578; &#1570;&#1608;&#1585;&#1583;&#1606; 
      &#1605;&#1602;&#1575;&#1583;&#1610;&#1585; &#1582;&#1585;&#1608;&#1580;&#1610; &#1583;&#1585; &#1588;&#1585;&#1575;&#1610;&#1591; &#1605;&#1582;&#1578;&#1604;&#1601; &#1608;&#1585;&#1608;&#1583;&#1610; &#1583;&#1585; &#1576;&#1585; &#1605;&#1610;&#1711;&#1610;&#1585;&#1606;&#1583;. </font></span>
    </p>
    <p>
      <span><font size="14.0pt" face="Tahoma,sans-serif">1. Sequential modular 
      (SM): each equipment class is not just a model<br>but it has a built-in 
      solution procedure. Then the simulator has to<br>find an order to solve 
      the equipments and pass the output solution of<br>the first to the 
      second and so on. If there are recycle streams you<br>need to break the 
      loop and iterate until convergence is achieved.<br>Examples: HySys, 
      Aspen Plus and Sim42 (I'm not sure if Sim42 is SM or a<br>hybrid 
      methodology).</font></span>
    </p>
    <p>
      <span><font size="14.0pt" face="Tahoma,sans-serif">2. Simultaneous or 
      equation oriented (EO): each equipment class is just<br>a model (a set 
      of equations for a set of variables). Then the simulator<br>just 
      assemble a big model and solve it by a Newton's like method (for<br>steady 
      state case) or with some DAE solver (dynamic case). EO is by far<br>more 
      suited for dynamic simulation. Examples: EMSO, gPROMS, Aspen<br>Dynamics, 
      ASCEND, Speed-Up.</font></span>
    </p>
    <span style="line-height: 115%"><font size="14.0pt" face="Tahoma,sans-serif"><br clear="all" style="line-height: 115%">
    </font></span>

    <p align="left" class="MsoNormal">
      <span style="line-height: 115%"><font size="14.0pt" face="Tahoma,sans-serif">&#160;</font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic"><b>&#1593;&#1606;&#1608;&#1575;&#1606; 
      &#1705;&#1575;&#1585;&#1711;&#1575;&#1607; &#1570;&#1605;&#1608;&#1586;&#1588;&#1610;:</b></font></span>
    </p>
    <p align="center" class="MsoNormal" style="text-indent: 36.0pt" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; 
      &#1578;&#1580;&#1607;&#1610;&#1586;&#1575;&#1578; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1610; &#1583;&#1585; &#1589;&#1606;&#1593;&#1578; &#1606;&#1601;&#1578;&#1548; &#1711;&#1575;&#1586; &#1608; &#1662;&#1578;&#1585;&#1608;&#1588;&#1610;&#1605;&#1610; &#1578;&#1608;&#1587;&#1591; &#1705;&#1583;&#1607;&#1575;&#1610; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586;</font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic"><b>&#1605;&#1602;&#1583;&#1605;&#1607;:</b></font></span><b><span><font size="14.0pt" face="Tahoma,sans-serif">&#160;&#160;&#160;&#160;&#160;&#160; 
      </font></span></b>
    </p>
    <p align="justify" class="MsoNormal" style="text-indent: 36.0pt; margin-right: 36.0pt" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1711;&#1587;&#1578;&#1585;&#1588; 
      &#1588;&#1576;&#1705;&#1607; &#1575;&#1610;&#1606;&#1578;&#1585;&#1606;&#1578; &#1608; &#1575;&#1576;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610; &#1576;&#1607; &#1575;&#1588;&#1578;&#1585;&#1575;&#1705; &#1711;&#1584;&#1575;&#1585;&#1610; &#1705;&#1583;&#1607;&#1575;&#1610; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1610; &#1583;&#1585; &#1587;&#1575;&#1604;&#1607;&#1575;&#1610; &#1575;&#1582;&#1610;&#1585; 
      &#1588;&#1585;&#1575;&#1610;&#1591;&#1610; &#1585;&#1575; &#1601;&#1585;&#1575;&#1607;&#1605; &#1570;&#1608;&#1585;&#1583;&#1607; &#1575;&#1587;&#1578;&#1548; &#1705;&#1607; &#1578;&#1608;&#1587;&#1593;&#1607; &#1605;&#1580;&#1605;&#1608;&#1593;&#1607; &#1607;&#1575;&#1610; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1610; &#1576;&#1586;&#1585;&#1711; &#1576;&#1575; &#1605;&#1588;&#1575;&#1585;&#1705;&#1578; 
      &#1605;&#1578;&#1582;&#1589;&#1589;&#1575;&#1606; &#1593;&#1604;&#1608;&#1605; &#1605;&#1582;&#1578;&#1604;&#1601; &#1583;&#1585; &#1610;&#1705; &#1601;&#1590;&#1575;&#1610; &#1605;&#1580;&#1575;&#1586;&#1610; &#1662;&#1585;&#1608;&#1688;&#1607; &#1575;&#1605;&#1705;&#1575;&#1606; &#1662;&#1584;&#1610;&#1585; &#1711;&#1585;&#1583;&#1583;. </font></span>
    </p>
    <p align="justify" class="MsoNormal" style="text-indent: 36.0pt; margin-right: 36.0pt" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1606;&#1585;&#1605; 
      &#1575;&#1601;&#1586;&#1575;&#1585; &#1588;&#1576;&#1610;&#1607;&#8204;&#1587;&#1575;&#1586;&#1610; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1607;&#1575;&#1740; &#1589;&#1606;&#1593;&#1578; &#1606;&#1601;&#1578;&#1548; &#1711;&#1575;&#1586; &#1608; &#1662;&#1578;&#1585;&#1608;&#1588;&#1610;&#1605;&#1740; &#1575;&#1586; &#1580;&#1605;&#1604;&#1607; &#1606;&#1585;&#1605; &#1575;&#1601;&#1585;&#1575;&#1586;&#1607;&#1575;&#1610; 
      &#1576;&#1606;&#1610;&#1575;&#1583;&#1610; &#1608; &#1586;&#1610;&#1585;&#1576;&#1606;&#1575;&#1610;&#1610; &#1583;&#1585; &#1575;&#1610;&#1606; &#1589;&#1606;&#1575;&#1610;&#1593; &#1576;&#1607; &#1588;&#1605;&#1575;&#1585; &#1605;&#1610;&#8204;&#1570;&#1610;&#1583;&#1548; &#1705;&#1607; &#1662;&#1610;&#1575;&#1583;&#1607;&#8204;&#1587;&#1575;&#1586;&#1610; &#1570;&#1606; &#1606;&#1610;&#1575;&#1586; &#1576;&#1607; 
      &#1607;&#1605;&#1705;&#1575;&#1585;&#1610; &#1605;&#1578;&#1582;&#1589;&#1589;&#1575;&#1606; &#1608; &#1662;&#1688;&#1608;&#1607;&#1588;&#1711;&#1585;&#1575;&#1606; &#1575;&#1586; &#1593;&#1604;&#1608;&#1605; &#1605;&#1607;&#1606;&#1583;&#1587;&#1610; &#1608; &#1705;&#1575;&#1605;&#1662;&#1610;&#1608;&#1578;&#1585; &#1583;&#1585; &#1705;&#1606;&#1575;&#1585; &#1605;&#1578;&#1582;&#1589;&#1589;&#1575;&#1606; &#1576;&#1582;&#1588; 
      &#1589;&#1606;&#1593;&#1578; &#1583;&#1575;&#1585;&#1583;. &#1606;&#1587;&#1582;&#1607;&#8204;&#1607;&#1575;&#1610; &#1575;&#1608;&#1604;&#1610;&#1607; &#1575;&#1610;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585; &#1605;&#1610;&#8204;&#1578;&#1608;&#1575;&#1606;&#1583; &#1705;&#1575;&#1585;&#1576;&#1585;&#1583;&#1607;&#1575;&#1610; &#1570;&#1605;&#1608;&#1586;&#1588;&#1610; &#1583;&#1585; 
      &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607; &#1607;&#1575; &#1608; &#1605;&#1585;&#1575;&#1705;&#1586; &#1570;&#1605;&#1608;&#1586;&#1588;&#1610; &#1583;&#1575;&#1588;&#1578;&#1607; &#1576;&#1575;&#1588;&#1583; &#1608; &#1583;&#1585; &#1605;&#1585;&#1575;&#1581;&#1604; &#1576;&#1593;&#1583;&#1548; &#1578;&#1705;&#1605;&#1610;&#1604; &#1570;&#1606; &#1605;&#1606;&#1580;&#1585; &#1576;&#1607; 
      &#1662;&#1583;&#1610;&#1583; &#1570;&#1605;&#1583;&#1606; &#1586;&#1610;&#1585; &#1576;&#1606;&#1575;&#1610;&#1610; &#1580;&#1607;&#1578; &#1705;&#1605;&#1705; &#1576;&#1607; &#1662;&#1610;&#1575;&#1583;&#1607; &#1587;&#1575;&#1586;&#1740; &#1605;&#1583;&#1608;&#1604;&#1607;&#1575;&#1740; &#1705;&#1575;&#1585;&#1576;&#1585;&#1583;&#1610; &#1576;&#1585;&#1575;&#1610; &#1591;&#1585;&#1575;&#1581;&#1610;&#1548; 
      &#1605;&#1583;&#1610;&#1585;&#1610;&#1578; &#1662;&#1585;&#1608;&#1688;&#1607;&#1548; &#1576;&#1607;&#1610;&#1606;&#1607; &#1587;&#1575;&#1586;&#1610;&#1548; &#1605;&#1606;&#1610;&#1578;&#1608;&#1585;&#1610;&#1606;&#1711; &#1610;&#1575; &#1705;&#1606;&#1578;&#1585;&#1604; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583; &#1711;&#1585;&#1583;&#1583;. </font></span>
    </p>
    <p align="justify" class="MsoNormal" style="text-indent: 36.0pt; margin-right: 36.0pt" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1575;&#1586; 
      &#1587;&#1608;&#1610; &#1583;&#1610;&#1711;&#1585; &#1605;&#1588;&#1575;&#1585;&#1705;&#1578; &#1583;&#1585; &#1662;&#1610;&#1575;&#1583;&#1607;&#8204;&#1587;&#1575;&#1586;&#1610; &#1670;&#1606;&#1610;&#1606; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1610; &#1605;&#1586;&#1575;&#1610;&#1575;&#1610; &#1602;&#1575;&#1576;&#1604; &#1578;&#1608;&#1580;&#1607;&#1610; &#1576;&#1585;&#1575;&#1610; 
      &#1575;&#1587;&#1575;&#1578;&#1610;&#1583; &#1583;&#1575;&#1606;&#1588;&#1580;&#1608;&#1610;&#1575;&#1606; &#1608; &#1662;&#1688;&#1608;&#1607;&#1588;&#1711;&#1585;&#1575;&#1606; &#1583;&#1585; &#1583;&#1575;&#1606;&#1588;&#1711;&#1575;&#1607; &#1608; &#1589;&#1606;&#1593;&#1578; &#1583;&#1575;&#1585;&#1583;. &#1588;&#1575;&#1610;&#1583; &#1605;&#1607;&#1605;&#1578;&#1585;&#1610;&#1606; &#1605;&#1586;&#1610;&#1578; 
      &#1585;&#1575; &#1576;&#1578;&#1608;&#1575;&#1606; &#1605;&#1605;&#1575;&#1606;&#1593;&#1578; &#1575;&#1586; &#1575;&#1606;&#1580;&#1575;&#1605; &#1601;&#1593;&#1575;&#1604;&#1610;&#1578;&#8204;&#1607;&#1575;&#1610; &#1578;&#1705;&#1585;&#1575;&#1585;&#1610; &#1583;&#1585; &#1578;&#1608;&#1604;&#1610;&#1583; &#1705;&#1583;&#1607;&#1575;&#1610; &#1705;&#1575;&#1605;&#1662;&#1610;&#1608;&#1578;&#1585;&#1610; &#1576;&#1575; 
      &#1575;&#1610;&#1580;&#1575;&#1583; &#1610;&#1705; &#1670;&#1607;&#1575;&#1585;&#1670;&#1608;&#1576; &#1605;&#1588;&#1578;&#1585;&#1705; &#1576;&#1610;&#1606; &#1585;&#1588;&#1578;&#1607;&#8204;&#1575;&#1610; &#1580;&#1607;&#1578; &#1578;&#1593;&#1585;&#1610;&#1601; &#1591;&#1610;&#1601; &#1608;&#1587;&#1610;&#1593;&#1610; &#1575;&#1586; &#1662;&#1585;&#1608;&#1688;&#1607;&#8204;&#1607;&#1575;&#1610; &#1705;&#1608;&#1670;&#1705; 
      &#1608; &#1576;&#1586;&#1585;&#1711; &#1583;&#1585; &#1587;&#1591;&#1608;&#1581; &#1605;&#1582;&#1578;&#1604;&#1601; &#1608; &#1593;&#1585;&#1590;&#1607; &#1581;&#1575;&#1589;&#1604; &#1578;&#1604;&#1575;&#1588;&#8204;&#1607;&#1575;&#1610; &#1601;&#1585;&#1583;&#1610; &#1576;&#1585;&#1606;&#1575;&#1605;&#1607; &#1606;&#1608;&#1610;&#1587;&#1575;&#1606; &#1583;&#1585; &#1602;&#1575;&#1604;&#1576; &#1610;&#1705; 
      &#1606;&#1585;&#1605;&#8204;&#1575;&#1601;&#1586;&#1575;&#1585; &#1576;&#1586;&#1585;&#1711; &#1583;&#1575;&#1606;&#1587;&#1578;.</font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic"><b>&#1605;&#1608;&#1590;&#1608;&#1593;:</b></font></span>
    </p>
    <p align="justify" class="MsoNormal" style="text-indent: 36.0pt; margin-right: 36.0pt" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic">&#1581;&#1575;&#1604; 
      &#1576;&#1575; &#1578;&#1608;&#1580;&#1607; &#1576;&#1607; &#1605;&#1602;&#1583;&#1605;&#1607; &#1601;&#1608;&#1602;&#1548; &#1605;&#1608;&#1590;&#1608;&#1593; &#1575;&#1610;&#1606; &#1705;&#1575;&#1585;&#1711;&#1575;&#1607; &#1575;&#1605;&#1705;&#1575;&#1606; &#1587;&#1606;&#1580;&#1610; &#1575;&#1580;&#1585;&#1575;&#1610; &#1610;&#1705; &#1662;&#1585;&#1608;&#1688;&#1607; &#1605;&#1588;&#1578;&#1585;&#1705; 
      &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1610; &#1605;&#1578;&#1606;&#8204;&#1576;&#1575;&#1586; &#1580;&#1607;&#1578; &#1578;&#1608;&#1587;&#1593;&#1607; &#1605;&#1583;&#1604;&#1607;&#1575;&#1610; &#1578;&#1580;&#1607;&#1610;&#1586;&#1575;&#1578; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1610; &#1583;&#1585; &#1589;&#1606;&#1593;&#1578; &#1606;&#1601;&#1578;&#1548; &#1711;&#1575;&#1586; &#1608; 
      &#1662;&#1578;&#1585;&#1608;&#1588;&#1610;&#1605;&#1610; &#1576;&#1575; &#1607;&#1605;&#1705;&#1575;&#1585;&#1610; &#1575;&#1587;&#1575;&#1578;&#1610;&#1583; &#1608; &#1583;&#1575;&#1606;&#1588;&#1580;&#1608;&#1610;&#1575;&#1606; &#1585;&#1588;&#1578;&#1607; &#1605;&#1705;&#1575;&#1606;&#1610;&#1705;&#1548; &#1605;&#1610;&#8204;&#1576;&#1575;&#1588;&#1583;. &#1575;&#1610;&#1606; &#1593;&#1606;&#1608;&#1575;&#1606; 
      &#1576;&#1582;&#1588; &#1605;&#1607;&#1605;&#1610; &#1575;&#1586;</font></span><font size="14.0pt" face="Traffic"><span>&#160; 
      </span><span lang="FA" style="line-height: 115%">&#1606;&#1585;&#1605;&#8204;&#1575;&#1601;&#1586;&#1575;&#1585; &#1576;&#1586;&#1585;&#1711;&#1578;&#1585;&#1610; &#1575;&#1587;&#1578; 
      &#1705;&#1607; &#1578;&#1608;&#1575;&#1606;&#1575;&#1610;&#1610; &#1588;&#1576;&#1610;&#1607;&#8204;&#1587;&#1575;&#1586;&#1610; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583; &#1585;&#1575; &#1583;&#1575;&#1585;&#1575; &#1575;&#1587;&#1578;. &#1576;&#1610;&#1575;&#1606; &#1605;&#1608;&#1590;&#1608;&#1593; &#1576;&#1575; &#1605;&#1588;&#1575;&#1607;&#1583;&#1607; &#1601;&#1593;&#1575;&#1604;&#1610;&#1578;&#8204;&#1607;&#1575;&#1610; 
      &#1575;&#1606;&#1580;&#1575;&#1605; &#1588;&#1583;&#1607; &#1583;&#1585; &#1605;&#1585;&#1705;&#1586;</span><span>&#160; 
      </span><span lang="FA" style="line-height: 115%">&#1570;&#1605;&#1608;&#1586;&#1588; &#1662;&#1578;&#1585;&#1608;&#1588;&#1610;&#1605;&#1610; &#1583;&#1585; &#1602;&#1575;&#1604;&#1576; 
      &#1575;&#1585;&#1575;&#1574;&#1607; &#1610;&#1705; &#1591;&#1585;&#1581; &#1662;&#1610;&#1588;&#1606;&#1607;&#1575;&#1583;&#1610; &#1608; &#1605;&#1593;&#1585;&#1601;&#1610; &#1575;&#1576;&#1586;&#1575;&#1585;&#1607;&#1575;&#1610; &#1576;&#1607; &#1575;&#1588;&#1578;&#1585;&#1575;&#1705; &#1711;&#1584;&#1575;&#1585;&#1610; &#1705;&#1583;&#1607;&#1575;&#1610; &#1606;&#1585;&#1605; &#1575;&#1601;&#1586;&#1575;&#1585;&#1610; 
      &#1608; &#1576;&#1610;&#1575;&#1606; &#1606;&#1581;&#1608;&#1607; &#1605;&#1588;&#1575;&#1585;&#1705;&#1578; &#1583;&#1585; &#1591;&#1585;&#1581; &#1607;&#1605;&#1585;&#1575;&#1607; &#1605;&#1610;&#8204;&#1576;&#1575;&#1588;&#1583;.</span></font>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span lang="FA" style="line-height: 115%"><font size="14.0pt" face="Traffic"><b>&#1575;&#1607;&#1583;&#1575;&#1601;:</b></font></span>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span><font size="14.0pt" face="Traffic"><b>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; </b></font></span><font size="14.0pt" face="Traffic"><span lang="FA" style="line-height: 115%">&#1575;&#1585;&#1575;&#1574;&#1607; 
      &#1610;&#1705; &#1591;&#1585;&#1581; &#1662;&#1610;&#1588;&#1606;&#1607;&#1575;&#1583;&#1740; &#1580;&#1607;&#1578; &#1605;&#1583;&#1604;&#1587;&#1575;&#1586;&#1610; &#1578;&#1580;&#1607;&#1610;&#1586;&#1575;&#1578; &#1601;&#1585;&#1570;&#1610;&#1606;&#1583;&#1610; &#1583;&#1585; &#1589;&#1606;&#1593;&#1578; &#1606;&#1601;&#1578;&#1548; &#1711;&#1575;&#1586; &#1608; &#1662;&#1578;&#1585;&#1608;&#1588;&#1610;&#1605;&#1610; 
      &#1578;&#1608;&#1587;&#1591; &#1705;&#1583;&#1607;&#1575;&#1610; &#1605;&#1578;&#1606; &#1576;&#1575;&#1586;.</span></font>
    </p>
    <p align="justify" class="MsoNormal" dir="RTL">
      <span><font size="14.0pt" face="Traffic">&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; </font></span><font size="14.0pt" face="Traffic"><span lang="FA" style="line-height: 115%">&#1570;&#1588;&#1606;&#1575;&#1610;&#1610; 
      &#1576;&#1575; &#1575;&#1576;&#1586;&#1575;&#1585;&#1607;&#1575;&#1740; &#1576;&#1607; &#1575;&#1588;&#1578;&#1585;&#1575;&#1705; &#1711;&#1584;&#1575;&#1585;&#1740; &#1705;&#1583; &#1608; &#1606;&#1581;&#1608;&#1607; &#1605;&#1588;&#1575;&#1585;&#1705;&#1578; &#1583;&#1585; &#1591;&#1585;&#1581;.</span></font>
    </p>
    <p align="justify" class="MsoNormal" style="line-height: normal">
      <span><font size="14.0pt" face="Tahoma,sans-serif">&#160;</font></span>
    </p>
  </body>
</html>
